; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image2 - mode
	thermograph0 - mode
	image1 - mode
	GroundStation3 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	Phenomenon6 - direction
	Phenomenon7 - direction
	Phenomenon8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 image2)
	(calibration_target instrument0 Star0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star5)
	(supports instrument1 thermograph0)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
	(supports instrument3 image2)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument4 image1)
	(supports instrument4 thermograph0)
	(supports instrument4 image2)
	(calibration_target instrument4 Star0)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star0)
)
(:goal (and
	(pointing satellite0 Star4)
	(have_image Star5 thermograph0)
	(have_image Phenomenon6 image1)
	(have_image Phenomenon7 image1)
	(have_image Phenomenon8 thermograph0)
	(have_image Planet9 thermograph0)
))

)

; plan
1. (switch_on instrument4 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument4)
   goals met: 0 of 6
2. (calibrate satellite4 instrument4 star0)
   added: (calibrated instrument4)
   goals met: 0 of 6
3. (turn_to satellite4 phenomenon8 star0)
   deleted: (pointing satellite4 star0)
   added: (pointing satellite4 phenomenon8)
   goals met: 0 of 6
4. (take_image satellite4 phenomenon8 instrument4 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 1 of 6
5. (turn_to satellite4 phenomenon7 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 phenomenon7)
   goals met: 1 of 6
6. (take_image satellite4 phenomenon7 instrument4 image1)
   added: (have_image phenomenon7 image1)
   goals met: 2 of 6
7. (turn_to satellite4 phenomenon6 phenomenon7)
   deleted: (pointing satellite4 phenomenon7)
   added: (pointing satellite4 phenomenon6)
   goals met: 2 of 6
8. (take_image satellite4 phenomenon6 instrument4 image1)
   added: (have_image phenomenon6 image1)
   goals met: 3 of 6
9. (turn_to satellite0 star4 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star4)
   goals met: 4 of 6
10. (turn_to satellite4 planet9 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet9)
   goals met: 4 of 6
11. (take_image satellite4 planet9 instrument4 thermograph0)
   added: (have_image planet9 thermograph0)
   goals met: 5 of 6
12. (turn_to satellite4 star5 planet9)
   deleted: (pointing satellite4 planet9)
   added: (pointing satellite4 star5)
   goals met: 5 of 6
13. (take_image satellite4 star5 instrument4 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 6 of 6
